
#include "log.h"

int main() {
    log();
    log("测试保留小数时的四舍六入五取偶");
    log();

    log("        舍入方向: ", dict_round[fegetround()]);
    test_double(
        "测试保留小数时的 五进",
        "0 01111111100 0000000000000000000000000000000000000000000000000001");
    test_double(
        "测试保留小数时的 五取偶(舍)",
        "0 01111111100 0000000000000000000000000000000000000000000000000000");
    test_double(
        "测试保留小数时的 五取偶(入)",
        "0 01111111101 1000000000000000000000000000000000000000000000000000");

    log();
    log("主进程正常退出");
    log();
    return 0;
}
