
#include "log.h"

void test(const std::string& name, const std::string& bit) {
    Double d(bit);

    log();
    log("        测试类型: " + name);
    log("    测试的二进制: " + d.bit_by_test);
    log("    存储的二进制: " + d.bit_by_cs);
    log("          手动值: " + d.double_by_hand);
    log("          存储值: " + d.double_by_cs);
}

void test() {
    log();
    log("测试存储时的四舍六入五取偶");
    log();

    log("        舍入方向: " + dict_round[fegetround()]);

    test("测试 最后一位是 0, 多余位是 00(舍)",
         "0100001100110000000000000000000000000000000000000000000000000000 00");

    test("测试 最后一位是 0, 多余位是 01(舍)",
         "0100001100110000000000000000000000000000000000000000000000000000 01");

    test("测试 最后一位是 0, 多余位是 10(舍, 取偶)",
         "0100001100110000000000000000000000000000000000000000000000000000 10");

    test("测试 最后一位是 0, 多余位是 11(入)",
         "0100001100110000000000000000000000000000000000000000000000000000 11");

    test("测试 最后一位是 1, 多余位是 00(舍)",
         "0100001100110000000000000000000000000000000000000000000000000001 00");

    test("测试 最后一位是 1, 多余位是 01(舍)",
         "0100001100110000000000000000000000000000000000000000000000000001 01");

    test("测试 最后一位是 1, 多余位是 10(入, 取偶)",
         "0100001100110000000000000000000000000000000000000000000000000001 10");

    test("测试 最后一位是 1, 多余位是 11(入)",
         "0100001100110000000000000000000000000000000000000000000000000001 11");
    log();
}

int main() {
    init();
    test();
    return 0;
}
